hi @hdryx,

I haven't been able to reproduce the failure that you're seeing, in fact, I was able to create a deployment and restore a snapshot from a different deployment, It took a while but it did succeeded:

```console
$ terraform apply
ec_deployment.example_minimal: Refreshing state... [id=78fd2ee921684fa51f84e890a092d2f4]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ec_deployment.second will be created
  + resource "ec_deployment" "second" {
      + alias                  = (known after apply)
      + apm_secret_token       = (sensitive value)
      + deployment_template_id = "aws-io-optimized-v2"
      + elasticsearch_password = (sensitive value)
      + elasticsearch_username = (known after apply)
      + id                     = (known after apply)
      + name                   = "second"
      + region                 = "us-east-1"
      + version                = "7.12.1"

      + elasticsearch {
          + autoscale      = (known after apply)
          + cloud_id       = (known after apply)
          + http_endpoint  = (known after apply)
          + https_endpoint = (known after apply)
          + ref_id         = "main-elasticsearch"
          + region         = (known after apply)
          + resource_id    = (known after apply)

          + snapshot_source {
              + snapshot_name                   = "__latest_success__"
              + source_elasticsearch_cluster_id = "91f4d594f97c43b3b36f56a1fedf594b"
            }

          + topology {
              + id                        = (known after apply)
              + instance_configuration_id = (known after apply)
              + node_roles                = (known after apply)
              + node_type_data            = (known after apply)
              + node_type_ingest          = (known after apply)
              + node_type_master          = (known after apply)
              + node_type_ml              = (known after apply)
              + size                      = (known after apply)
              + size_resource             = (known after apply)
              + zone_count                = (known after apply)

              + autoscaling {
                  + max_size             = (known after apply)
                  + max_size_resource    = (known after apply)
                  + min_size             = (known after apply)
                  + min_size_resource    = (known after apply)
                  + policy_override_json = (known after apply)
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ec_deployment.second: Creating...
ec_deployment.second: Still creating... [10s elapsed]
[..]
ec_deployment.second: Still creating... [13m40s elapsed]
ec_deployment.second: Creation complete after 13m42s [id=5c12d78269da361f3bf8a31940922813]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

were the two deployments in the same region? It's one of the requirements for the snapshot restoration process to work successfully [as documented in the registry](https://registry.terraform.io/providers/elastic/ec/latest/docs/resources/ec_deployment#source_elasticsearch_cluster_id).